app/views/users/show.html.erb


<% User.all.distinct.reverse.each do |u| %>
---
SELECT DISTINCT "users".* FROM "users"