app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      name = [params[:name]]
      if @post.save
---
INSERT INTO "posts" ("name", "heart_beat", "latitude", "longtitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "danny"], ["heart_beat", 60], ["latitude", 122.53], ["longtitude", 23.12], ["created_at", "2015-08-22 02:21:14.390936"], ["updated_at", "2015-08-22 02:21:14.390936"]]