app/controllers/resps_controller.rb

SELECT "resps".* FROM "resps"
---
  def index
    @resps = Resp.all

INSERT INTO "resps" ("name", "heart_beat", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Danny"], ["heart_beat", 100], ["latitude", "10.0"], ["longitude", "100.0"], ["created_at", "2015-08-22 09:03:42.296950"], ["updated_at", "2015-08-22 09:03:42.296950"]]
---
  def create
    @resp = Resp.new(resp_params)

    respond_to do |format|
      if @resp.save

SELECT  "resps".* FROM "resps" WHERE "resps"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_resp
      @resp = Resp.find(params[:id])