app/controllers/tests_controller.rb

  def create
    @test = Test.new(test_params)

    respond_to do |format|

      if @test.save
---
INSERT INTO "tests" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-08-22 02:18:33.885816"], ["updated_at", "2015-08-22 02:18:33.885816"]]