app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("mac", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["mac", "123"], ["name", ""], ["created_at", "2015-08-22 10:08:50.854920"], ["updated_at", "2015-08-22 10:08:50.854920"]]