app/controllers/usrs_controller.rb

  def index
    @usrs = Usr.all
---
SELECT "usrs".* FROM "usrs"